adjust project template to data engineering or data modelling project
